# ახსენით რა განსხვავებაა implicit და explicit datatype comversion-ში.
# Implicit conversion ავტომატურად ხდება, როცა სისტემა გარდაქმნის მონაცემს ინფორმაციის დაკარგვის გარეშე, ხოლო explicit conversion კი პროგრამისტის მიერ ხელით მითითებული გარდაქმნაა, რომელიც შესაძლებელია საჭიროებდეს casting-ს, რათა ტიპები სწორად შეიცვალოს.



# შექმენით პროგრამა რომელიც მიიღებს მომხარებლისგან input-ს რიხვის სახით და დაბეჭდეთ ამ რიცხვამდე ყველა რიცხვი თანმიმდევრობით. (For loop)
num = int(input("შეიყვანეთ რიცხვი: "))  # მომხმარებლის მიერ შეყვანილი რიცხვი
for i in range(1, num + 1):  # იტერაცია 1-დან num-ის ჩათვლით
    print(i)


# გაალეთეთ მეოთხე დავალება While loop-ის გამოყენებით.
num = int(input("შეიყვანეთ რიცხვი: "))  # მომხმარებელი შეჰყავს რიცხვი
i = 1  # ინიციალიზაცია

while i <= num:  # სანამ i ნაკლებია ან ტოლია num-ს
    print(i)  # ბეჭდავს მიმდინარე რიცხვს
    i += 1  # ზრდის i-ს 1-ით

