# გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ
for i in range (16):
    print("niko")

for i in range (16):
    print("tsulaia")

# გამოიტანეთ ტერმინალში რიცხვები 1-დან 20-ის ჩათვლით
for i in range (1,20):
    print(i)

# გამოიტანეთ ტერმინალში რიცხვები 20-დან 0-მდე

for i in range (20, -1, -1):
    print(i)


# გამოიტანეთ რიცხვები 10-დან 15-მდე
num = 10
while num <= 15:
    print(num)
    num += 1


# გამოიტანეთ რიცხვები 50-დან 0-მდე
num = 50
while num >= 0:
    print(num)
    num -= 1



# კომენტარის სახით ახსენით რა არის counter ცვლადი და როდის ვიყენებთ While Loop-ს
# "Counter" ცვლადი არის რიცხვი, რომელსაც ვიყენებთ იმისთვის,
# რომ ვაკონტროლოთ რამდენჯერ სრულდება ციკლი.
# While loop ვიყენებთ მაშინ, როცა გვინდა რაღაც განმეორდეს,
# სანამ მოცემული პირობა მართალია.



# გამოიტანეთ მხოლოდ ლუწი რიცხვები 10-დან 70-მდე
num = 10 
while num <= 70: 
    print(num) 
    num += 2  


# გამოიტანეთ კენტი რიცხვები 25-დან 55-მდე
num = 25
while num <= 55:
    print(num)
    num += 2
