# 1) კომენტარებით ახსენით რისთვის გამოიყენება Len()-ფუნქცია
# len ს ვიყენებთ მაგალითად რომ დავითვალოთ მთლიანობაში რამდენი ადამიანია ჩემს საიტში და ასე შემდეგ


# 2)კომენტარებით ახსენით რისთვის გამოიყენება List-ი
# list ს ვიყენებთ მაგალითად რამოდენიმე ელემენტის შესანახად



# 3)კომენტარებით ახსენით რა განსხვავებაა List-სა და ცვლადებ-ს შორის
# ცვლადი არის მონაცემთა შწსანახი კონტეინერი რომელიც შეინახავს ერთ მნიშვნელობას ხოლო ლისთი არის მრავალი ელემენტის შეგროვება ერთ მონაცემთა სტრუქტურაში

# 4)რისი შენახვა შეუძლია list-ს?
# ლისთს ყველაფრის შენახვა შეუზლია არააქვს მნიშვნელობა რა ტიპის ცვლადი იქნება მაგალითად list = [42, "hello", 3.14, True, None]





# 5)შექმენი ლისტი, შეინახეთ სამი წიგნის სახელი. დაბეჭდე მთელი სია და დაბეჭდე, რამდენი წიგნია მასში.

books = ["To Kill a Mockingbird", "Harry Potter", "The Great Gatsby"]
print(books)
print(len(books))
