# შემოიტანეთ თქვენი ოჯახის წევრების ასაკი და დაუპრინტეთ თუ რამდენი წლისები იქნებიან 25 წლის შემდეგ(გამოიყენეთ int ფუნქცია).
age = int(input("enter ypur age:"))
num1 = int("25")
result = (age + num1)
print(result)
# # მომხმარებელს შემოატანინეთ მისი სახელი და type ფუნქციის საშუალებით გაიგეთ რა ტიპის მონაცემია შემოტანილი მნიშვნელობა.
name = input("your name:")
print(type(name))
# მომხმარებელს შემოატანინეთ მისი ასაკი და შემდეგ გადააქციეთ სტრინგად
age = input("enter your age:")
age_string = str(age)
print(age_string)
# კომენტარებით ახსენით რას აკეთებს str(),int() და float() ფუნქციები.
# str() ფუნქცია ყველანაირ ტიპის მონაცემებს გადაიტანს სტრინგ ფუნქციად.
# ფუნქცია გამოიყენება მონაცემის მთელ რიცხვად გადასაყვანად.ამას ხშირად იყენებენ როცა გსურთ სტრინგი ან სხვა ტიპის მონაცემი ინტეჯერად გადაიყვანო.
# float() კი გამოიყენება მონაცემის ათწილადად გადასაყვანად ეს საჭიროა მთელი რიცხვის ათწილადად გადასაყვანად.
