# მომხმარებელს შემოატანინეთ სამი რიცხვი, start/end/step და ჩასვით for loop-ში სათანადო ადგილას.
start = int(input("შეიყვანეთ საწყისი რიცხვი: "))
end = int(input("შეიყვანეთ საბოლოო რიცხვი: "))
step = int(input("შეიყვანეთ ნაბიჯი: "))

for i in range(start, end + 1, step):  # for loop start, end, და step-ის მიხედვით
    print(i)


# მომხმარებელს შემოატანინეთ რიცხვი და დაპრინტეთ რიცხვი ყოველ იტერაციაზე იქამდე, სანამ რიცხვი მომხმარებლის რიცხვს არ გაუტოლდება (While Loop)
num = int(input("შეიყვანეთ რიცხვი: "))  # მომხმარებლის მიერ შეყვანილი რიცხვი
i = 1  # საწყისი მნიშვნელობა

while i <= num:  # სანამ i არ გაუტოლდება num-ს
    print(i)  # ბეჭდავს i-ს
    i += 1  # ზრდის i-ს 1-ით


# გააკეთეთ {2.} classwork For loop-ის გამოყენებით
num = int(input("შეიყვანეთ რიცხვი: "))  # მომხმარებელი შეყვანს რიცხვს

for i in range(1, num + 1):  # იტერაცია 1-დან num-ის ჩათვლით
    print(i)  # ბეჭდავს მიმდინარე რიცხვს

