while True:  # პირობა ყოველთვის True-ა, ამიტომ ციკლი უსასრულოდ მუშაობს
    print("ეს არის უსასრულო ციკლი!")

# - გამოიტანეთ მომხმარებლის შემოყვანილი სახელი 10-ჯერ იტერაციის მეშვეობით
name = input("შეიყვანეთ თქვენი სახელი: ")
count = 0  # იტერაციის საწყისი

while count < 10:  # 10-ჯერ შევასრულებთ
    print(name)
    count += 1  # ვზრდით count-ს ერთი ერთეულით

# - შექმენით while loop და კომენტარად მიაწერეთ რომელია თავი და რომელი სხეული
count = 5  # თავი (საწყისი მნიშვნელობა)

while count > 0:  # ციკლის პირობა (გააგრძელე სანამ count > 0)
    print("Count =", count)  # სხეული (მოქმედება, რაც ციკლში სრულდება)
    count -= 1  # ცვლილება (count-ის შემცირება)

# - მომხმარებელს შემოაყვანინეთ რიცხვი, სანამ ეს რიცხვი არ იქნება 100-ზე მეტი მაქამდე თავიდან მოთხოვთ რიცხვის შემოტანა
num = int(input("შეიყვანეთ რიცხვი: "))

while num <= 100:  # სანამ რიცხვი 100-ზე ნაკლები ან ტოლია
    print("რიცხვი ძალიან მცირეა, სცადეთ თავიდან!")
    num = int(input("შეიყვანეთ რიცხვი: "))

print("რიცხვი საკმარისად დიდია!")

# - მომხმარებელს შემოატანინეთ სხვადასხვა სახელები 5-ჯერ იტერაციის მეშვეობით, შექმენით ამ სახელებისთვის ცვლადი რომელშიც ყოველი სახელი დაემატება და ეს სახელები გამოიყოფა მძიმეებით, ანუ თქვენი ცვლადი 5 სახელის შეყვანის შემდეგ უნდა გამოიყურებოდეს ასე: "{სახელი პირველი}, {სახელი მეორე}, ... {სახელი მეხუთე}"

names = []  # სიის შექმნა

for i in range(5):  # 5-ჯერ გამეორება
    name = input(f"შეიყვანეთ {i+1}-ე სახელი: ")
    names.append(name)  # სიაში დამატება

# სახელების დაბეჭდვა, გამოყოფილი მძიმით
print(", ".join(names))