# 1)დაწერე პროგრამა, რომელიც while ციკლით დაბეჭდავს რიცხვებს 1-დან 10-მდე.2)დაწერე პროგრამა, რომელიც დაბეჭდავს რიცხვებს 10-დან 1-მდე.3)კომენტარებით ახსენი while loop. 4)დაწერე პროგრამა, რომელიც სთხოვს მომხმარებელს პაროლის შეყვანას. სწორი პაროლია "python123". სანამ სწორად არ შეიყვანს, მოთხოვე თავიდან.5)მომხმარებელმა უნდა შეიყვანოს რიცხვი n. პროგრამამ while ციკლით უნდა დაითვალოს 1-დან n-მდე რიცხვების ჯამი.

num = 1  # ვიწყებთ 1-დან
while num <= 10:  # სანამ num 10-ზე ნაკლები ან ტოლია, ვბეჭდავთ
    print(num)
    num += 1  # ყოველ ციკლზე num-ს ვზრდით ერთით


num = 10  # ვიწყებთ 10-დან
while num >= 1:  # სანამ num 1-ზე მეტია ან ტოლია, ვბეჭდავთ
    print(num)
    num -= 1  # ყოველ ციკლზე num-ს ვამცირებთ ერთითb


# **while loop** არის ციკლი, რომელიც განმეორებით ასრულებს კოდის ბლოკს, სანამ მოცემული პირობა ჭეშმარიტია (True).
# თუ პირობა ცრუ (False) ხდება, ციკლი წყდება.

# მაგალითი:
num = 5
while num > 0:  # სანამ num 0-ზე მეტია, ციკლი შესრულდება
    print("Num =", num)
    num -= 1  # num-ს ვამცირებთ ერთით, რათა ციკლი დასრულდეს


correct_password = "python123"
password = input("შეიყვანეთ პაროლი: ")

while password != correct_password:  # სანამ პაროლი არ ემთხვევა "python123"-ს
    print("არასწორი პაროლი, სცადეთ თავიდან!")
    password = input("შეიყვანეთ პაროლი: ")

print("პაროლი სწორია!")


n = int(input("შეიყვანეთ რიცხვი: "))
sum_total = 0  # ჯამის საწყისი მნიშვნელობა

num = 1
while num <= n:  # სანამ num n-ზე ნაკლები ან ტოლია
    sum_total += num  # ვუმატებთ num-ს ჯამში
    num += 1  # num-ს ვზრდით ერთით

print("1-დან", n, "-მდე რიცხვების ჯამი:", sum_total)