# 1) მომხმარებლის მიერ შეტანილი სტრინგის პირველი ასოს გამოტანა
user_string = input("შეიყვანეთ სტრინგი: ")
print("პირველი ასო:", user_string[0])

# 2) ორი სტრინგის შეყვანა და გაერთიანება
string1 = input("შეიყვანეთ პირველი სტრინგი: ")
string2 = input("შეიყვანეთ მეორე სტრინგი: ")
print("გაერთიანებული სტრინგი:", string1 + " " + string2)

# 3) მომხმარებლის მიერ შეტანილი სტრინგის შემოწმება
user_input = input("შეიყვანეთ სტრინგი: ")

if user_input.lower() == "yes":  # lower() ფუნქცია ტექსტს მცირე ასოებად გარდაქმნის, რათა "YES"-ის შემთხვევაშიც იმუშაოს
    name = input("შეიყვანეთ თქვენი სახელი: ")
    print("თქვენი სახელი:", name)

print("goodbye")  # ყოველთვის გამოდის გამოსამშვიდობებელი მესიჯი

# 4) მომხმარებლის მიერ შეტანილი ასოს შემოწმება და შესაბამისი მნიშვნელობის გამოტანა
letter = input("შეიყვანეთ ასო: ")

if letter == "A":
    print(100)
elif letter == "B":
    print(80)
elif letter == "C":
    print(60)
elif letter == "D":
    print(40)
elif letter == "F":
    print("Failed!")
else:
    print("უცნობი ასო.")



    # მომხმარებლისგან ორი სტრინგის შეყვანა
str1 = input("შეიყვანეთ პირველი სტრინგი: ")
str2 = input("შეიყვანეთ მეორე სტრინგი: ")

# თუ სტრინგები ერთმანეთს ემთხვევა გამოიტანს True, წინააღმდეგ შემთხვევაში False
print(str1 == str2)
