# ტერმინალში გამოიტანეთ თქვენი სახელი 50 ჯერ გამოიყენეთ for loop
for i in range(50):
    print("nikolozi")

# ტერმინალში გამოიტანეთ რიცხვები 0 დან 40 მდე
for i in range(0,40):
    print(i)

# ტერმინალში გამოიტანეთ რიცხვები 20 დან 40 ის ჩათვლით 5 ი step ის გამოტოვებით
for i in range(20,41,5):
    print(i)

# შექმენით ცვლადი და მასში შეინახეთ თქვენი სახელი,თქვენი დავალება იქნება გამოიტანოთ თითოეული ასო ცალ ცალკე გამოიყენე for loop
name = "nikolozi"
for i in name:
    print(i)

# ტერმინალში გამოიტანე რიცხვები 100 დან 2000 მდე 100 step ის გამოტოვებით
for i in range(100,2000,100):
    print(i)