#გააკეთეთ ორ რიცხვს შორის თითოეულ მათემატიკურ ოპერაციაზე 5-5 მაგალითი (+,-,*,/) და დაპრინტეთ

print(5 + 5)

print(20 - 15)

print(10 * 5)

print(10 / 5)



#ცვლადები სადაც იქნება თქვენი სახელი, თქვენი გვარი, თქვენი ასაკი და დაბეჭდეთ ერთ დიდ წინადადებაში

name = "ნიკო"
surname = "წულაია"
age = 16

print ("ჩემი სახელია" ,name , "ჩემი გვარია" ,surname , "მე ვარ" ,age ,"წლის")

#დავიმატოთ ერთმანეთი და ჩამოვწეროთ ყველას სახელი და გვარები

#დათო ლომიაშვილი
#დანიელ ღონიაშვილი
#ლუკა ტრაპაიძე
#ყოჩაშვილი შაკო


#შექმენი 9 ცვლადი, 3 ცვლადი იყოს Str, 3 ცვლადი int, 3 ცვლადი float, და შემდეგ გამოიტანე ტერმინალში 9-ვე ცვლადი print-ის მეშვეობით.

city = "თბილის"
country = "საქართველო"
name = "ირაკლი"

age = 20
integer = 299
meters = 5

price = 5.60
answer = 12.35
float = 2.5

print ("city")
print ("country")
print ("name")
print ("age")
print ("integer")
print ("meters")
Print ("price")
print ("answer")
print ("float")
