# while ციკლის გამოყენებით გამოიტანეთ 1 დან 20 მდე ყველა რიცხვი
i = 1
while i <= 20:
    print(i)
    i += 1




# შექმენით ცვლადი რომელშიც შენახული იქნება პინ კოდი მაგ:1234 და მომხმარებელს შემოაყვანინეთ პინ კოდი და შეინახეთ ისიც ცვლადში, სანამ შემოყვანილი პინ-კოდი არ დაემთხვევა ორიგინალ პინ-კოდს მომხმარებელს შემოაყვენინეთ თავიდან   (while ციკლის გამოყენებით)

original_pin = "1234"  # დაცული პინ კოდი
entered_pin = ""  # მომხმარებლის შეყვანილი პინი

while entered_pin != original_pin:
    entered_pin = input("enter your pin:")

print("correct!")









# for ციკლის საშუალებით 1 დან 20მდე დაპრინტეთ ყველა ლუწი რიცხვი 
for i in range(1, 21):
    if i % 2 == 0:
        print(i)



#  for ციკლის საშუალებით 1 დან 30 მდე დაპრინტეთ ყველა კენტი რიცხვი
for i in range(1, 31):
    if i % 2 != 0:
        print(i)



# while ციკლის საშუალებით 1 დან 10მდე დაპრინტეთ ყველა ლუწი რიცხვი
i = 2
while i <= 10:
    print(i)
    i += 2
