# რაში გვეხმარება Indexing-ი?~
# ინდექსინგი გვეხმარება მარტივად  მივწვდეთ კონკრეტულ ელემენტს სიაში, სტრიქონში ან სხვა მონაცემთა ტიპში.


# შეიყვანე ტექსტი და დაბეჭდე მისი პირველი სიმბოლო.

# მაგ: "hello" → `h`
txt = "armwrestling"
print(txt[0])



# მოცემულია სია: `['cat', 'dog', 'fish']`
# დაბეჭდე მეორე ელემენტი (ინდექსინგით).

# ელემენტი უნდა იყოს `"dog"`
pets = ['cat', 'dog', 'fish']
print(pets[1])



# შეიყვანე ტექსტი და დაბეჭდე ბოლო სიმბოლო ინდექსის მეშვეობით (არა სლაისინგით და არა უარყოფითი ინდექსით).
# მაგ: "hello" → `o` (მოძებნე `len(text) - 1` ინდექსით)

txt = "hello world"
last_index = len(txt) - 1
print(txt[last_index])



