for _ in iter(int, 1):  # `iter(int, 1)` ქმნის უსასრულო იტერატორს
    print("ეს არის უსასრულო ციკლი!")


name = input("შეიყვანეთ თქვენი სახელი: ")

for _ in range(10):  # 10-ჯერ გამეორება
    print(name)

# **თავი**: ციკლის დაწყება და ცვლადის აღწერა
# **სხეული**: ის კოდი, რომელიც ყოველ ციკლში შესრულდება

for count in range(5, 0, -1):  # 5-დან 1-მდე
    print("Count =", count)  # ეს არის ციკლის სხეული



while True:  # უსასრულო ციკლი
    num = int(input("შეიყვანეთ რიცხვი: "))
    if num > 100:  # თუ 100-ზე მეტია, ციკლი წყდება
        break
    print("რიცხვი ძალიან მცირეა, სცადეთ თავიდან!")



names = []  # სიის შექმნა

for i in range(5):  # 5-ჯერ გამეორება
    name = input(f"შეიყვანეთ {i+1}-ე სახელი: ")
    names.append(name)  # სიაში დამატება

print(", ".join(names))  # ყველა სახელი მძიმეებით გამოყოფილი