# მომხმარებელს შემოატანინეთ ორი რიცხვი და შეინახეთ ისინი ცვლადებში,შემდეგ დაპრინტეთ ამ ორ რიცხვს შორის ყველა მათემატიკური ოპერაცია
num1 = input("enter number1:")
num2 = input("enter number2:")
print(int(num1) + int(num2))
print(int(num1) / int(num2))
print(int(num1) * int(num2))
print(int(num1) - int(num2))
# ახსენით კომენტარებით რაში გვჭირდება საუკეთესო პრაქტიკები პროგრამირებაში
# ისინი გვეხმარებიან ადვილ წაკითხვაში და ასევე გაგებაშიც
#  ასევე ახსენით რა არის snake case და case sensitivity
# Snake case არის წერის სტილი, სადაც სიტყვები ერთმანეთისგან გამოყოფილია ქვედა ხაზით და ყველა ასო არის პატარა
# Case sensitivity: ნიშნავს რომ პროგრამაში დიდი და პატარა ასოები ერთმანეთისგან განსხვავდება