# striing(სტრინგი) -> "niko" რაღაც მონაცემი რომელიც მოქცეულია ბრჭყალებს შორის (str)
# integer(ინტეჯერი) -> 5, 10 მთელი რიცხვი (int)
# float(ათწილადი) -> 5.5 , 2.5 (float)


#როგორ ავხსნათ რასაც დავწერთ

#ჩადური გზა:
# შევქმენით ცვლადი სახელად name რომელსაც მნოშვნელობად გადავეციტ, სტრინგ ტიპის მნიშვნელობა "niko"

#ვირჯინული გზა:
#შევქმენით ცვლადი და შევინახეთ ნიკო

# / - ვაბრუნებთ ზუსტი გაყოფის შედეგს(float)
# // - ვაბრუნებთ მთელ რიცხვს (int)
# % - გვიბრუნებს გაყოფის შედეგად მიღებულ ნაშთს

# კონკატინაცია - სტრინგების ერთმანეთთან შეერთება

print (5 - 5)
print (10 * 10)