# მომხმარებელს შემოატანინეთ რაღაც რიცხვი და შემდეგ შეამოწმეთ თუ ეს რიცხვი არის ლუწი,დაბეჭდეთ "even", ხოლო თუ კენტია "odd"
num = int(input("შეიყვანეთ რიცხვი: "))

if num % 2 == 0:
    print("even")
else:
    print("odd")



# ცვლადში შეინახეთ თქვენი სახელი, მომხმარებელს შემოატანინეთ მისი სახელი და თუ თქვენი სახელები ემთხვევა დაუპრინტეთ "Hello" სხვა შემთხვევაში "Bye"
my_name = "Niko" 
user_name = input("შეიყვანეთ თქვენი სახელი: ")

if user_name == my_name:
    print("Hello")
else:
    print("Bye")



# მომხმარებელს შემოატანინეთ რიცხვი და შეამოწმეთ, თუ რიცხვი მეტია 90-ზე, დაბეჭდეთ "A", თუ რიცხვი ნაკლებია 90-ზე და მეტია 70-ზე, დაბეჭდეთ "B", თუ რიცხვი ნაკლებია 70-ზე და მეტია 50-ზე, დაბეჭდეთ "C", სხვა შემთხვევაში დაბეჭდეთ "D"

num = int(input("შეიყვანეთ რიცხვი:" ))
if num > 90:
    print("A")
elif num > 70:
    print("B")
elif num > 50:
    print("C")
else:
    print("D")

# while ციკლის მეშვეობით, შექმენით რიცხვების დიაპაზონი 1-დან 100 ჩათვლით, შეამოწმეთ თუ რიცხვი არის ლუწი, დაბეჭდეთ ეს რიცხვი while ციკლში და მიუწერეთ რომ ლუწია, თუ კენტია, დაბეჭდეთ ეს რიცხვი და გვერძე მიუწერეთ რომ კენტია / მაგ: (1 კენტიტა, 2 ლუწია, 3 კენტია, 4 ლუწია...)
num = 1

while num <= 100:
    if num % 2 == 0:
        print(i, "ლუწია")
    else:
        print(i, "კენტია")
    num += 1
