# for ციკლის საშუალებით გამოიტანეთ 1 დან 20მდე ყველა რიცხვი, იგივე ქენით while ციკლის საშუალებით

for i in range(1, 21):
    print(i)

num = 1
while num <= 20:
    print(num)
    num += 1



#  ახსენით რა არის sequencing, iteration და selection 

# Sequencing ნიშნავს, რომ კოდის ინსტრუქციები სრულდება მიყოლებით, ერთი მეორის შემდეგ.
# Iteration არის პროცესის განმეორება, როცა კოდი ერთსა და იმავე მოქმედებას მრავალჯერ ასრულებს
# Selection გულისხმობს გადაწყვეტილების მიღებას კოდის შიგნით, სადაც გარკვეული პირობის მიხედვით სხვადასხვა ქმედება ხდება.



#  ახსენით რა დროს ვიყენებთ while და for ციკლებს
# While ციკლი ვიყენებთ მაშინ, როცა არ ვიცით რამდენჯერ უნდა შესრულდეს მოქმედება და გვჭირდება პირობის მიხედვით განმეორება. მაგალითად, სანამ მომხმარებელი არ შეიყვანს სწორ პასუხს.
# For ციკლი ვიყენებთ მაშინ, როცა ზუსტად ვიცით რამდენჯერ უნდა შესრულდეს ოპერაცია, მაგალითად, რიცხვების ან ელემენტების გადარბენის დროს.
