# კომენტარის სახით ჩამოთვალე ჩაშენებული ფუნქციები და რას შვება თითეული აღწერე
# print() ეკრანზე გამოაქვს რიმე ტექსტი
# input() ადამიანისგან იღებს მონაცემს როგორც სტრინგს
# len() აბრუნებს ობიექტის სიგრძეს
# type() გვიჩვენებს რა ტიპის მონაცემთან გვაქვს საქმე.
# int() სტრიქონს ან float-ს გარდაქმნის მთელ რიცხვად.
# float() გარდაქმნის მნიშვნელობას ათწილადად
# str() სხვა ტიპის მონაცემებს სტრინგად გარდაქმნის.
# range() ქმნის რიცხვთა მიმდევრობას


# კომენატრებით ახსენით როგორ იქმენბა def ფუნქცია 
# იყენებ def-ს ფუნქციის დასაწყებად
# წერ ფუნქციის სახელს
# ფრჩხილებში მიუთითებ საჭირო პარამეტრებს
# ფუნქციის სხეულში წერ რა უნდა შეასრულოს
# იყენებ return-ს შედეგის დასაბრუნებლად




#  შექმენით def ფუნქცია სახელად greet - მას უნდა ჰქონდეს 1 არგუმენტი name და  უნდა დაწერე მისალმების ფუნქცია 
def greet(name):
    print("hello" + name)
greet("lasha")
