# დაებეჭდე სია ყოველ მეორე ელემენტზე.

# numbers = [10, 20, 30, 40, 50, 60, 70]

# 📌 შედეგი უნდა იყოს უნდა იყოს: [10, 30, 50, 70]

numbers = [10, 20, 30, 40, 50, 60, 70]
print(numbers[::2])


# დაებეჭდე სია უკუღმა (reverse slicing გამოიყენე).

# letters = ['a', 'b', 'c', 'd', 'e']

# 📌 შედეგი უნდა იყოს: ['e', 'd', 'c', 'b', 'a']

letters = ['a', 'b', 'c', 'd', 'e']
print(letters[::-1])


# დაიბეჭდოს ყოველი მესამე ელემენტი სიიდან, დაწყებული მეორე ელემენტიდან.

# items = ['x', 'y', 'z', 'a', 'b', 'c', 'd']

# 📌 შედეგი უნდა იყოს: ['y', 'a', 'd']
items = ['x', 'y', 'z', 'a', 'b', 'c', 'd']
print(items[1::3])


# დაბეჭდე სტრინგი "Hello, World!" უკუღმა, ყოველი მეორე ასო.

# text = "Hello, World!"

# 📌 შედეგი უნდა იყოს: '!lo olH'

text = "Hello, World!"
print(text[::-2])

