# ტერმინალში გამოიტანეთ თქვენი სახელი და გვარი 30 ჯერ გამოიყენე for loop
for i in range(30):
    print("nikolozi")

for i in range(30):
    print("tsulaia")


# ტერმინალში გამოიტანეთ რიცხვები 0 დან 50 ის ჩათვლით  გამოიყენე for loop
for i in  range(0,50):
    print(i)

# ტერმინალში გამოიტანეთ რიცხვები 25 იდან 100 მდე  გამოიყენე for loop
for i in range(25,100):
    print(i)


# ტერმინალში გამოიტანეთ რიცხვები 5 დან 65 ის ჩათვლით 5 step ის გამოტოვებით  გამოიყენე for loop
for i in range(5,65,5):
    print(i)


# ტერმინალში გამოიტანეთ რიცხვები 0 დან 1000 მდე 150 step ის გამოყენებით   გამოიყენე for loop
for i in range(0,1000,150):
    print(i)

# შექმენი ცვლადი და ამ ცვალდში შენინახე რომელიმე ავტომობილის სახელი,თქვენი დავალებაა გამოიტანოთ თითოეული ასო ამ სიტყვიდან  გამოიყენე for loop
name = "toyota"
for i in name:
    print(i)