#  შექმენით 2 ცვლადი და მესამე ცვლადში შეინახეთ, წინა ორი ცვლადის მნიშვნელობების ჯამი და გამოიტანეთ შედეგი ეკრანზე.
# num = 10 
# num1 = 15
# result = num + num1
# print(result)


# #დაწერეთ 5 არასწორი კოდი, გაასწორეთ მათში შეცომები და კომენტარებით ახსენით რა შეცდომები იყო კოდში და დაწერეთ გასწორებული ვერსია
# # age -> 15
# age = 15
# #აქ შეცდომაა რადგან age ს შემდეგ უნდა ეწეროს ტოლობის ნიშანი
# # name = "niko
# name = "niko"
# #აქ შეცდომაა ის რომ დამხურავი პრჭყალი არ აქვს
# # print(name"
# print(name)
# #აქ ისაა შეცდომა რომ ფრჩხილებით რომ იწყებოდა არ უნდა მთავრედბოდეს პრჭყალებით


# #print(age)
# #age = 15
# age = 15
# print(age)
# #პითონი ამ კოდებს ზემოდან ქვემოთ კითხულობს და აქ ისაა შეცდომა რომ ჯერ პრინტი წერია და მერე ასაკი და რადგანაც ზემოდან ქვემოთ კითხულობს ვერ მიხვდება რა უნდა გაუშვას
# # num = 10
# # print(num + num1)
# # num1=15
# num = 10
# num1 = 15
# result = num + num1
# print (result)
# #აქ არეულად წერია კოდები და რესულტ აკლია



#ახსენით კომენტარებით რა არის Debugging
#Debugging არის კოდებში შეცდომების პოვნა 
