
# 1)  შექმენით List, List-ში შეინახეთ 4 მანქანა და შემდეგ მე-1 და მე-2 ინდექსი შეცვალეთ, საბოლოოდ დაპრიტეთ მთლიანი List-ი


cars = ["Toyota", "BMW", "Mercedes", "Audi"]
cars[0] = "Lexus"
cars[1] = "Ford"
print(cars)





#  რაში გვეხმარება ინდექსინგი? რა შეგივიძლია გავაკეთოთ ინდექსინგის მეშვეობით? შეგვიძლია თუ არა სტრინგების შეცვლა?
# ინდექსი გვეხმარება იმის გასაგებად, თუ სად არის რაღაც ელემენტი სიაში ან ტექსტში. მისი საშუალებით შეგვიძლია ვნახოთ ან შევცვალოთ ეს ელემენტი სტრინგები ვერ იცვლება პირდაპირ ინდექსით, მაგრამ შეგვიძლია ახალი ტექსტი შევქმნათ ძველის ბაზაზე.




# #  txt = "hello world, python html" 
# --დაბეჭდეთ სტრინგის პირველი ასო,
# --დაბეჭდეთ სტრინგის ბოლო ასო ნეგატიური ინდექსის გამოყენებით,
# --ახსენი როგორ მუშაობს ინდექსები ანუ საიდან იწყება ასევე ნეგატიური ინდექსი საიდან იწყება 

txt = "hello world, python html"
print(txt[0])
print(txt[-1])
# ინდექსები გვეხმარება ელემენტებზე წვდომაში. იწყება 0-დან (პირველი), -1-დან უკანასკნელი. დადებითი მიდის მარცხნიდან მარჯვნივ, ნეგატიური — უკანიდან წინ.