#  შექმენი for loop- რომელიც გამოიტანს 1-100 ჩატვლით რიცხვებს და ასევე კენტია თუ ლუწი ეს რიცხვი.

for i in range(1, 101):
    if i % 2 == 0:
        print(i, "ლუწია")
    else:
        print(i, "კენტია")


#  მომხმარებელს შემოატანინეთ რიცხვი და და გამოიტანეთ ეს რიცხვი კენტია თუ ლუწი
num = int(input("შეიყვანეთ რიცხვი: "))  # მომხმარებლის მიერ შეყვანილი რიცხვი

if num % 2 == 0:
    print(num, "ლუწი")
else:
    print(num, "კენტი")

#  მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ 'მეტია' თუ მეორე რიცხვი პირველზე მეტია თუ არადა დაბეჭდეთ  ''ნაკლებია"
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

if num2 > num1:
    print("მეტია")
else:
    print("ნაკლებია")


#  მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ უფრო მაღალი რიცხვი 
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

print(max(num1, num2))  

